{
    "article": [
        {
            "type": "text",
            "text": "Last year, Creative announced their Super X-Fi holographic audio technology, the biggest announcement they have made in a decade. Through mapping your head and ear shape, it promises to bring audio alive. Does it live up to all that hype? Let’s take a look at the S$219 Creative SXFI Air headphones."
        },
        {
            "type": "text",
            "text": "This is not to be confused with the Creative SXFI Air C, which looks very similar but isn’t wireless. That one retails at S$199 and connects only to devices with USB Type C."
        },
        {
            "type": "header",
            "text": "Design – Professional Design, Solid Construction"
        },
        {
            "type": "text",
            "text": "Creative did a fabulous job with the design. With a minimalist matte-plastic design and faux leather covering the headband, it is easy to mistake this for a pair of headphones for audio professionals. That is until you turn on the RGB ring around the ear cups. Then, it makes you look like a gamer."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg1.jpg?alt=media&token=78e41971-618a-4261-81a5-bcd4c46f26eb"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg2.jpg?alt=media&token=ca4206ee-c75d-41b4-a4cb-27170af2a98f"
        },
        {
            "type": "text",
            "text": "The headband has quite a bit of padding, but it is pretty firm. Meanwhile, the earmuffs have fabric cushioning that are soft and thick. It has a quick release mechanism, for easy replacement. The earcups have some tilt to them and that allows the SXFI Air to sit nicely around your ears."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg3.jpg?alt=media&token=93a4a7b0-e639-47e9-817d-c38de6464d9c"
        },
        {
            "type": "text",
            "text": "All of that makes the Creative SXFI Air very comfortable on the head. At 338g though, it is quite heavy, which can take a toll on your neck after a long listening session. Being an over-ear headphone, it is pretty bulky too. The headband is adjustable, but not foldable so it takes up quite a bit of space in your bag."
        },
        {
            "type": "subheader",
            "text": "Controls & Ports"
        },
        {
            "type": "text",
            "text": "All the controls and connectors are located on the left earcup. To the front, there is a power button as well as a detachable NanoBoom microphone. It connects to the headphone via an audio jack and works with other devices. However, the SXFI Air doesn’t seem to work well with other microphones."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg4.jpg?alt=media&token=4e5a8e53-5c63-4d3d-8ec8-0d794ecb8e9a"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg5.jpg?alt=media&token=770d16fb-40c5-4ead-9866-adb6d54f2202"
        },
        {
            "type": "text",
            "text": "On the back, we have a textured button that enables/disables Super X-Fi. Below that, we have a MicroSD card slot, as well as a button for switching sources. There are 3 ways you can listen on the Creative SXFI Air: Bluetooth, wired (USB or audio jack) and SD Card. Flexible."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg6.jpg?alt=media&token=d977ed63-13ff-4d17-a782-d93c65abcc0d"
        },
        {
            "type": "text",
            "text": "The USB Type-C port at the bottom serves 2 purposes: charging and audio input. Connect it to your PC this way to enjoy games and movies that support 7.1 surround sound. Beside the USB Type-C port is an audio jack, which will allow you to listen to music without power. But no power means no Super X-Fi."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg7.jpg?alt=media&token=5ceab9ce-9881-463e-89bf-b9072a4c5116"
        },
        {
            "type": "text",
            "text": "How do you control audio playback and volume? The left earcup has touch controls. A double tap plays/pauses music, front/back swipe goes to next/previous track and up/down swipe controls volume. I found the touch controls to be hit or miss; sometimes it isn’t responsive, sometimes it is too responsive."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg8.jpg?alt=media&token=1b8dd2d8-a772-4629-9107-637e371a7f05"
        },
        {
            "type": "subheader",
            "text": "Light Rings"
        },
        {
            "type": "text",
            "text": "As mentioned earlier, the earcups have light rings that provide a gamery feel, with over 16M colors to choose from. It stays on until you turn it off in the app. The light also notifies you about the battery status of the device whenever you power it on: green is high, yellow is medium and red is low."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg9.jpg?alt=media&token=07502ae5-2d68-45ab-a511-7e3074f6c619"
        },
        {
            "type": "text",
            "text": "One quirk about it is that after turning it off, it will turn back on every time you power the headphones on. That isn’t a big deal if you use it at home. But in public, the lights are just too attention-grabbing and I try to turn it off every time. I wish there was a physical switch to turn on/off the lights."
        },
        {
            "type": "header",
            "text": "Setup & App – Why Does It Need 2 Apps?"
        },
        {
            "type": "text",
            "text": "To pair the Creative SXFI Air to your device, simply power it on and long press the source button to enter pairing mode. Then, select it in the Bluetooth settings of your device."
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg10.jpg?alt=media&token=a0896b9e-10ba-4328-9dcd-6a39b74da0e6"
        },
        {
            "type": "text",
            "text": "You will need to download 2 apps to get started. The first is the SXFI app, required for setting up your SXFI profile. The app will scan your head, as well as both ears. After that, you can uninstall the app."
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg11.jpg?alt=media&token=7bddd6dc-4b8a-45fe-8de4-4cbb6daeffbf"
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg12.jpg?alt=media&token=6c52cb10-df38-4313-a5e9-9c92464d77f9"
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg13.jpg?alt=media&token=7495e608-a9d1-45ae-ad4a-66f82081f004"
        },
        {
            "type": "text",
            "text": "The next app is the SXFI AIR Control app, which is the main app of the headphone. Here, you can select source, enable/disable SXFI, EQ and RGB light, as well as set the color of the lights. Also, if you are using an SD card with the headphones, you can select which track to play here."
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg14.jpg?alt=media&token=d7798f0c-6886-471d-b617-73dd8d931f74"
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg15.jpg?alt=media&token=ef5f59a0-69da-40c0-937c-913e486d4fa8"
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg16.jpg?alt=media&token=923d2c72-2826-4ccb-9ba9-db6cb632a383"
        },
        {
            "type": "text",
            "text": "It is a rather basic app and does everything it needs to. However, Creative can still work on the organization of the app to make it more user friendly. Also, I wish we could do head mapping directly from this app. @Creative I have designed an improve layout for the app. PM me if you are interested."
        },
        {
            "type": "text",
            "text": "There is also a SXFI Control Windows 10 software with the same controls, plus a toggle to enable 7.1 surround sound content. It is easy to use, but the I wish Creative can put everything on one page and scale up the icons/texts a bit. There is so much unused space, so why not make full use of it?"
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg17.jpg?alt=media&token=37da6949-73d9-4f55-b2d3-097b0a072adb"
        },
        {
            "type": "header",
            "text": "Sound – A New Form of Audio Consumption"
        },
        {
            "type": "text",
            "text": "Before I get into how I feel about Super X-Fi, as well as the overall sound quality, let’s take a look at the various ways to listen on it. As stated above, there are 3 ways to listen to audio on the SXFI Air. (4 if you include headphone jack, but I would consider that to be the “emergency” option)"
        },
        {
            "type": "subheader",
            "text": "Bluetooth"
        },
        {
            "type": "text",
            "text": "It is unfortunate that SXFI Air only supports the SBC codec, which is very lossy and has high latency. But my biggest issue with the Bluetooth connection is that it is not very steady. Just walking around a shopping mall, the SXFI Air’s connection dropped multiple times. Avoid crowded areas."
        },
        {
            "type": "subheader",
            "text": "SD Card"
        },
        {
            "type": "text",
            "text": "You can plug in an SD card up to 32GB into the SXFI Air, FLAC files supported. That isn’t a lot if you listen to very high res audio. But if you are an audiophile, you wouldn’t be using these headphones."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg18.jpg?alt=media&token=a7854306-ede1-46d1-81f6-1decfd784138"
        },
        {
            "type": "subheader",
            "text": "USB"
        },
        {
            "type": "text",
            "text": "You can plug the SXFI Air into your computer with a USB Type-C cable and use it like a regular pair of USB headphones. But if you want to experience Super X-Fi with wired connection, I recommend getting the SXFI AMP instead as it can be used with much better headphones."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg19.jpg?alt=media&token=2a17f30e-0b79-4540-8691-09ae66e67e72"
        },
        {
            "type": "subheader",
            "text": "Quality & Super X-Fi"
        },
        {
            "type": "text",
            "text": "The sound it produces without Super X-Fi is a little bright, with crisp trebles and pleasant mids, but not very punchy bass. It is great, but not S$219 good. If you do not plan to use Super X-Fi, there is absolutely no reason to get it. But does Super X-Fi justify the price tag?"
        },
        {
            "type": "text",
            "text": "From my experience, Super X-Fi works best with videos, where immersion matters a lot more than quality. For most videos, turning on Super X-Fi really brings you into the scene."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fcreative-sxfi-air-review%2Fimg20.jpg?alt=media&token=2d156133-9223-4586-b5ca-53f50a0f5b13"
        },
        {
            "type": "text",
            "text": "There is a half second delay when playing PUBG Mobile, but it brings the game to life. Normally, a gunshot from the left side would be very loud in the left earcup and very soft in the right. With Super X-Fi, both earcups are loud, though the right side remains louder, which is a lot more realistic."
        },
        {
            "type": "text",
            "text": "For music consumption, it will take some time for your ears to adapt and accept Super X-Fied audio. At first, it felt a little bit like standing outside of a concert hall, like there was a wall between you and the singer. Not very enjoyable and you would rather listen with Super X-Fi disabled."
        },
        {
            "type": "text",
            "text": "But after enough “warm up” time, I found that my ears got used to the feeling of Super X-Fi and I loved it. There were a couple of songs that sounded really harsh with Super X-Fi, but it worked well for most."
        },
        {
            "type": "text",
            "text": "Phone calls are really fun with the Creative SXFI Air. It feels really weird but cool at the same time, like the person is all around you. You have to try it at least once in your lifetime."
        },
        {
            "type": "header",
            "text": "Battery – Respectable Endurance"
        },
        {
            "type": "text",
            "text": "Creative claims up to 10 hours of battery life on the SXFI Air and I got close. Connecting via Bluetooth, it started having issues with connection after 8h 40min of continuous music playback. I would say that it was unusable by then. Ring lights and Super X-Fi were enabled throughout the entire duration."
        },
        {
            "type": "header",
            "text": "Future Improvements"
        },
        {
            "type": "text",
            "text": "Creative SXFI Air doesn’t have the best sound quality for its price, but it makes up for that with a unique trick: holographic audio. If you watch a lot of movies on your phone or laptop, I would highly recommend trying out the SXFI Air. It is a game changer for mobile video consumption."
        },
        {
            "type": "text",
            "text": "That said, Creative’s first pair of Super X-Fi wireless headphones still has a lot of room for improvement."
        },
        {
            "type": "text",
            "text": "Firstly, I hope Creative can find a way to make it lighter. It is very comfortable for short listening sessions. But for longer duration, fatigue gets in the way. Secondly, I would really like to see a physical switch for turning on/off the light ring. Doesn’t make sense to open the app every time to turn it off."
        },
        {
            "type": "text",
            "text": "Next, I would like to see Creative improve the Bluetooth connectivity of the SXFI Air. It is the least stable Bluetooth headphones I have used, sometimes even losing connection when I am at home. Also, I would like to see Creative add support for better codecs like aptX."
        },
        {
            "type": "text",
            "text": "Lastly, features in the app are well implemented, but their organization can be better. I actually find the menu to be quite redundant, as most of the stuff can be accessed via the dashboard. Also, Creative should build the head mapping feature directly into the SXFI Air Control app."
        }
    ]
}