{
    "article": [
        {
            "type": "text",
            "text": "As someone who do not game, I don’t expect a lot from my computer peripherals. All I hope for are reliability, efficiency and comfort. I am sure many of you are like me too. So in this article, let’s take a look at 2 devices by Logitech, made for productivity-minded people like us."
        },
        {
            "type": "text",
            "text": "I bought the K375s keyboard recently for S$29 (U.P. S$45), after I got a monitor for my laptop. Meanwhile, I have been using the M331 mouse (U.P. S$32) for a while now, after selling away my beloved M585."
        },
        {
            "type": "header",
            "text": "Design – Modern & Practical"
        },
        {
            "type": "subheader",
            "text": "Logitech K375s Multi-Device Wireless Keyboard"
        },
        {
            "type": "text",
            "text": "Both devices are considerably stylish compared to the competition. K375s has a pretty solid build with little flex. On the rear, we have retractable legs with fixed postion. When closing the legs, you can feel a weak resistance from the spring inside. So satisfying! We also have an on/off switch at the back."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg1.jpg?alt=media&token=c47e65b7-7ec9-48d4-ae58-0d931a25c414"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg2.jpg?alt=media&token=ef804bf4-6e95-43cd-bfa6-17e1694af1ef"
        },
        {
            "type": "text",
            "text": "The keyboard uses two AAA batteries. Logitech included 2 Duracell AAA batteries in the box, so you can use it immediately after unboxing."
        },
        {
            "type": "text",
            "text": "Logitech K375s is a full size keyboard, so you have the number pad on the right. The layout is pretty standard, which is a great thing. It should feel really familiar to most people. There is however one unique thing about it. Notice how the F1 to F3 keys are in grey; they are used for switching between devices."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg3.jpg?alt=media&token=a34bea7f-0895-4d3b-b79d-2da65c0ebc30"
        },
        {
            "type": "text",
            "text": "With minimal “bezels” on top and at the side, the K375s is quite compact. About the only annoyance I have with it is the lack of indicator lights. Without it, I often have difficulties knowing if caps lock is on."
        },
        {
            "type": "text",
            "text": "The K375s comes with an unusual accessory: a phone/tablet stand. It is made out of matte plastic, but it matches the looks of the keyboard. The base is pretty big, so tablets (in horizontal mode) wouldn’t topper."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg4.jpg?alt=media&token=59962860-7882-42e2-afa7-c8046d5c50f3"
        },
        {
            "type": "subheader",
            "text": "Logitech M331 Silent Plus Wireless Mouse"
        },
        {
            "type": "text",
            "text": "Meanwhile, the Logitech M331 has a pretty ergonomic design, for right-handers at least. There is a curved on the left side, where the right thumb rests. The highest point of the mouse is where the center of your palm will be. And it’s size is perfect for most hands. Overall, the comfort is really there."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg5.jpg?alt=media&token=af5b94a5-805c-4143-9aed-e54b85e318e9"
        },
        {
            "type": "text",
            "text": "M331 has a mainly matte plastic body, with a nice shiny matte finish on the top. Along the sides where you hold the mouse, it is covered in this rubbery material. This provides a really nice grip."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg6.jpg?alt=media&token=4fb0ed98-d33e-496f-a4f4-643f217a6932"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg7.jpg?alt=media&token=0901af24-2239-4af7-b700-3bc47cd3c978"
        },
        {
            "type": "text",
            "text": "On the bottom, we have the on/off switch as well as the “invisible optic”, which uses laser beams that are not visible. Opening the battery cover reveals a single AA battery, as well as a slot for the dongle. There is decent padding on the bottom, so it doesn’t make a lot of noise when gliding across the table."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg7.jpg?alt=media&token=0901af24-2239-4af7-b700-3bc47cd3c978"
        },
        {
            "type": "header",
            "text": "Connectivity – Piece of Cake"
        },
        {
            "type": "text",
            "text": "The selling point of the K375s is its ability to connect to multiple devices. It can pair with up to 3 devices, via Bluetooth or the Unifying receiver. To set up Bluetooth is really easy. Hold down the button corresponding to the device you want to pair (1. 2 or 3), then pair it like a regular Bluetooth device."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg9.jpg?alt=media&token=b5e9ddd3-50fa-4a88-955f-1f8a63f01830"
        },
        {
            "type": "text",
            "text": "If you have a mouse that supports Unifying, you might want to use the included Unifying receiver instead. To connect to a Unifying receiver, download the Unifying software, linked here. Open the software, turn off and on your keyboard and the software should detect it."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Flogitech-k375s-keyboard-m331-mouse-review%2Fimg10.jpg?alt=media&token=f2e823bc-73f2-410f-8f7c-cc9800d06006"
        },
        {
            "type": "text",
            "text": "Next, lets connect the M331 mouse. It doesn’t come with a Unifying receiver, but it does support Unifying. The way you pair it to a Unifying receiver is the same. Open the software, turn the mouse off and on. If you aren’t using Unifying, no setup is required for the included non-Unifying receiver."
        },
        {
            "type": "imageSingle",
            "text": ""
        },
        {
            "type": "text",
            "text": "If you have multiple computers and don’t mind spending a little more, I recommend getting the M590 mouse instead. That way, both your keyboard and mouse can connect to Bluetooth and make use of Logitech’s Flow technology. Note that Logitech Flow doesn’t work on Android at the moment."
        },
        {
            "type": "header",
            "text": "Usage – Mostly a Great Experience"
        },
        {
            "type": "text",
            "text": "Keys on K375s has enough travel to satisfy anyone using it for productivity work. Other than the space key, they are all very silent. The function keys are almost as tall as the other keys, which makes them easy to press. This keyboard’s design may be very basic, but it works well and that is what matters."
        },
        {
            "type": "text",
            "text": "As mentioned earlier, my only gripe with it is the lack of indicator lights for caps lock. Sometimes, you may accidentally press it instead of tab or shift, and you will only know about it when you start typing."
        },
        {
            "type": "text",
            "text": "As the name “Silent Plus” implies, the buttons on the M331 are also very quiet. The buttons require very little force to be depressed, though they don’t go down very far. The scroll wheel is smooth, but not as smooth as the M545 where you just loose control. Due to the ergonomics, I had no issue using it over a long period."
        },
        {
            "type": "text",
            "text": "Logitech claims a single set of battery can last you 24 months for both devices. I haven’t used the keyboard long enough to say anything about it. But I have been using the M331 mouse for over a year now and I haven’t had to change the included GP AA battery. Nice!"
        },
        {
            "type": "header",
            "text": "Future Improvements"
        },
        {
            "type": "text",
            "text": "Not sure how feasible it is, but I hope to see Bluetooth in the M331’s successor, without increasing the price. I know they have the M337, but that costs S$49 and the M585 would be a better deal at that price. Why? Phones are coming with “Desktop Mode” these days and they work best with a Bluetooth mouse."
        },
        {
            "type": "text",
            "text": "Next, like I have mentioned multiple times, I would like to see indicator lights for caps lock. A lack of one can be quite frustrating. Lastly, it would be nice if the corners of the phone stand was not so sharp."
        }
    ]
}