{
    "article": [
        {
            "type": "text",
            "text": "Hey there, 8K here!"
        },
        {
            "type": "text",
            "text": "This review is, as you may have inferred from the title, all about the OPPO watch. I was intially intending to make this a video review. But after filming a couple of clips, I felt that an article will better express my feelings towards this product. There is just too much to talk about it!"
        },
        {
            "type": "text",
            "text": "Spoiler: OPPO Watch isn’t perfect, but it is a lot more polished than I would expect for a first gen product. If this is the direction Wear OS is moving towards, I am hyped!"
        },
        {
            "type": "header",
            "text": "To-Do After Setting Up"
        },
        {
            "type": "text",
            "text": "Upon setting up the OPPO Watch, do the following to get a better experience:"
        },
        {
            "type": "text",
            "text": "1. Enable auto-brightness."
        },
        {
            "type": "text",
            "text": "2. Enable Wi-Fi and connect to a network."
        },
        {
            "type": "text",
            "text": "3. Download HeyTap Health app."
        },
        {
            "type": "text",
            "text": "4. Shift strap fastener ring to the pin side."
        },
        {
            "type": "header",
            "text": "Design"
        },
        {
            "type": "text",
            "text": "OPPO’s smartwatch may look a lot like a certain watch by a fruity company, but there is a lot more to it. It’s craftsmanship is very delicate, as we have come to expect from OPPO products. Its display is curved on the sides, making swiping very pleasant. And with a smartly-designed UI, you can hardly notice its bezels."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg1.jpg?alt=media&token=c9eafee0-a896-4d30-8008-e445556a30f3"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg2.jpg?alt=media&token=81586cb8-44b6-4980-8ff8-0d61e1bf923d"
        },
        {
            "type": "text",
            "text": "In other words, this is one premium feeling smartwatch."
        },
        {
            "type": "subheader",
            "text": "Size & Ergonomics"
        },
        {
            "type": "text",
            "text": "OPPO Watch is availble in 2 sizes: 41mm (S$299) and 46mm (S$399), the latter of which I got to test over the past few days. Despite my small wrist, the 46mm model fit snugly around it. If you don’t wear a watch regularly, you will feel its presence. There is some weight to it, but not heavy enough to bother me."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg3.jpg?alt=media&token=09eaf2fd-4f5e-48cf-a5ea-bc2d4c4f9534"
        },
        {
            "type": "subheader",
            "text": "Physical Controls"
        },
        {
            "type": "text",
            "text": "Instead of a crown, OPPO Watch has 2 buttons, both to the right. The top button is what you will use to bring up the app drawer. A long press brings up the Google assistant. The one below, with a green accent, is a customizable button that doubles as a power button. You can set this to open any app."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg4.jpg?alt=media&token=d88decd3-607b-4bda-bafd-85052d59f59c"
        },
        {
            "type": "subheader",
            "text": "Display"
        },
        {
            "type": "text",
            "text": "You can find AMOLED panels on wearables that cost as low as S$30 these days, but what sets this one apart is that it looks so much better: Sharp, large and with popping colors. And as mentioned earlier, it is curved on the sides, possibly the first on a wearable. Corners are curved to match the body."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg5.jpg?alt=media&token=7a57c7b0-720d-4637-8195-4f49c55245e8"
        },
        {
            "type": "text",
            "text": "Brightness is good, with great visibility under sunlight. With the default setting, it can be a little glaring at night. I recommend turning on auto-brightness in the settings."
        },
        {
            "type": "text",
            "text": "This is about as good as you can get on a smartwatch in 2020."
        },
        {
            "type": "subheader",
            "text": "Strap"
        },
        {
            "type": "text",
            "text": "Perhaps the thing that bothers me most about the OPPO Watch is the strap. Don’t get me wrong. The straps included are quite comfortable. It also dries up surprisingly quick after a shower, so I didn’t had to remove it from my wrist to dry every time. (It’s like magic!)"
        },
        {
            "type": "text",
            "text": "But for some reason, OPPO thought it was a good idea to have the pin facing up, away from your wrist. This meant that you have to align the hole to the pin instead of the other way round. This unconventional wearing process takes some getting used to if you are coming from a fitness tracker like the Mi Band."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg6.jpg?alt=media&token=91d534bf-c12f-4ce8-92c5-52e033b7ef11"
        },
        {
            "type": "text",
            "text": "To make wearing the OPPO Watch easier, I highly recommend shifting over the strap’s fastener ring over to the pin side. Trust me, this will save you a lot of time."
        },
        {
            "type": "text",
            "text": "These straps uses a proprietary connector, so you can’t simply change it with any other watch strap. The good news is, OPPO is bringing more straps to Singapore really soon."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg7.jpg?alt=media&token=ad8a4a1b-abe0-4162-bb68-f4af3fdb81bd"
        },
        {
            "type": "header",
            "text": "Software"
        },
        {
            "type": "text",
            "text": "OPPO Watch runs Wear OS, but this is nothing like the Wear OS you are used to. It is a heavily modified version, with numerous enhancements that makes it 100x more capable and fun to use. As someone that feels Wear OS is too basic, this is (almost) everything I have been waiting for."
        },
        {
            "type": "subheader",
            "text": "Watch Navigation"
        },
        {
            "type": "text",
            "text": "OPPO doesn’t include a lot of watchfaces, but the ones that are there are all so well designed that I will gladly use any of them. With AI outfit, you can even create custom watchfaces based on the colors of your #OOTD. And if you want, you can set any photo as background in the HeyTap Health app."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg8.jpg?alt=media&token=8a2a540d-727a-4f6f-a532-4bfd2eade995"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg9.jpg?alt=media&token=95ef529a-c0a3-44cc-a2d4-3f51aca5b7a6"
        },
        {
            "type": "text",
            "text": "Swiping your primary means of navigating around the UI. From the watch face, swipe down to bring down control panel. Here, you have quick access to some of the commonly used toggles, like muting and do not disturb. Swipe up to bring up your notifications, which you can clear away with a swipe to the right."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg10.jpg?alt=media&token=d97a4022-9d94-4eaf-8a59-0339df276151"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg11.jpg?alt=media&token=16e84b00-53ae-4033-b375-4dc1e3318709"
        },
        {
            "type": "text",
            "text": "Swiping left from the watchface shows your fitness data, like steps, heartrate and sleep. Meanwhile, a swipe to the right brings up the Google assistant page."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg12.jpg?alt=media&token=38e1d990-62a7-4082-9d6e-95d7479b2493"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg13.jpg?alt=media&token=9e6fe1e2-d54c-4de4-833a-fac037fc52f0"
        },
        {
            "type": "text",
            "text": "On any page, a swipe from the left edge will go back to the previous page. As someone who wears the watch on the left hand, I wish I could set it to a swipe from the right edge."
        },
        {
            "type": "text",
            "text": "As stated earlier, the top physical button brings up the app drawer. Unlike regular Wear OS, apps here are arranged in grid of 3, greatly reducing the need to scroll. This comes at the trade-off of not being able to see the apps’ names. Once you get familiar with it, this isn’t a problem."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg14.jpg?alt=media&token=05dd650a-1f81-4f58-a772-c64ebd5cdbdb"
        },
        {
            "type": "text",
            "text": "With a square display, OPPO has an advantage over its competitors when it comes to making use of screen space. Seeing what they did to this version Wear OS, I am glad they did not waste the opportunity."
        },
        {
            "type": "subheader",
            "text": "Fitness Features"
        },
        {
            "type": "text",
            "text": "OPPO Watch supports tracking of running, walking, cycling and swimming as workouts."
        },
        {
            "type": "text",
            "text": "The first time I took it for a run, I started “Fitness Run” and was shocked when it started counting down. Wait, this thing can speak? This thing can speak! The watch prompts you whenever you hit a certain milestone, or whenever your heart rate goes beyond a limit."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg15.jpg?alt=media&token=c89c22e2-b0d6-4709-a342-a4f1486ad5c5"
        },
        {
            "type": "text",
            "text": "On top of having the regular workout tracking modes, OPPO also included a 5 minute workout feature. If you are too busy to go out for a run, maybe consider doing this during breaks?"
        },
        {
            "type": "text",
            "text": "There are 5 mini workouts to choose from, each containing a couple of quick exercises. What I really like about this feature is that it uses both audio and visuals to guide you. My only gripe is that it doesn’t follow your pace; you have to follow it. Otherwise, it would have been perfect."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg16.jpg?alt=media&token=f883c933-22de-4c32-8cfc-7e796bd4f1ff"
        },
        {
            "type": "subheader",
            "text": "Third Party Apps"
        },
        {
            "type": "text",
            "text": "OPPO Watch comes with an app store, which has a decent range of apps from music to games. The first app I downloaded was 2048, I had an absolute blast with it. The game was fun, but the square display made it even better. It was a perfect match."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg17.jpg?alt=media&token=018b2f1b-e79b-4f1d-87ef-e5e82f44536b"
        },
        {
            "type": "subheader",
            "text": "Music"
        },
        {
            "type": "text",
            "text": "When you have your phone paired, you can control media from the watch, if the app supports. It works perfectly for apps like YouTube, Play Music and Facebook. Strangely though, OPPO’s own music player doesn’t show album art. Otherwise, it works pretty well."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg18.jpg?alt=media&token=2c7f0408-1afe-4259-b030-6f63c01a44dd"
        },
        {
            "type": "text",
            "text": "I also tried the music player apps, but my experience wasn’t as pleasant. I couldn’t get Spotify to pair (probably needed a subscription). KKBox could stream music, but I couldn’t store any song to the watch. It just wouldn’t download, probably due to the way OPPO Watch handles files."
        },
        {
            "type": "text",
            "text": "What about transfering your local music to the watch? I connected the charger to my laptop and the watch appeared, but I got an error when I tried to paste the songs. So while the watch has 4.3GB of available storage, you cannot use it to store any music. It just isn’t possible, at least at the moment."
        },
        {
            "type": "text",
            "text": "With the Wi-Fi model, you can forget about leaving your phone at home to go for a run if you need music. And yes, the watch supports Bluetooth headphones, though it is useless without being able to store music."
        },
        {
            "type": "subheader",
            "text": "Phone App(s)"
        },
        {
            "type": "text",
            "text": "To make full use of the OPPO Watch, you will need to download not one, but two apps. First is the Wear OS app, which is a must have for all Wear OS smartwatches. It is what you will use to set up the watch, and it allows you to change the watchface, toggle some settings and check battery usage."
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg19.jpg?alt=media&token=0dec70de-cbd5-493c-aabc-b7459c345413"
        },
        {
            "type": "text",
            "text": "The second is OPPO’s own HeyTap Health app, which is where you check fitness data. You can also change watch face here, though only on this app will you be able to configure the AI outfit watch face."
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg20.jpg?alt=media&token=b6185c00-8357-4d78-808e-40efc5aa1173"
        },
        {
            "type": "text",
            "text": "I wish OPPO had integrated the setup and pairing process into this app, so that you only need one app to use the OPPO Watch. Google probably would not have allowed it though."
        },
        {
            "type": "header",
            "text": "Battery"
        },
        {
            "type": "subheader",
            "text": "Endurance"
        },
        {
            "type": "text",
            "text": "OPPO Watch’s greatest weakness is its endurance. While it isn’t horrible, it is not good either. OPPO claims 36h of usage on normal mode. From my usage, that seems possible, though what you get can vary greatly. And the most significant factor is whether you use any third party apps."
        },
        {
            "type": "text",
            "text": "Without using third party apps, I was able to get close to or even exceed 30h on some days. That was mainly under minimal usage, but with auto heart rate reading and Wi-Fi still enabled. On one of those days, I even brought it out for a run, where it used GPS."
        },
        {
            "type": "imageTriple",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg21.jpg?alt=media&token=365454df-caa9-4516-bc5f-033b9b438a74"
        },
        {
            "type": "text",
            "text": "But the moment you start using third party apps actively, battery drains much quicker. It drained out in under 18h on one of the days, after I played about 3 rounds of 2048. While the Snapdragon 3100 processor doesn’t stutter, it doesn’t seem to be very efficient either."
        },
        {
            "type": "text",
            "text": "This smartwatch actually has a second processor inside, one that is used for the low power mode. OPPO claims 21 days of usage in this mode, but is this what you are paying so much for? Unless you are going hiking, were you might not be able to charge it for days, why would you use this mode?"
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg22.jpg?alt=media&token=b94fdfd2-68db-492b-b737-d83634e0277c"
        },
        {
            "type": "subheader",
            "text": "Charging"
        },
        {
            "type": "text",
            "text": "OPPO Watch charges via the charging dock. At first, I was disappointed at how the plastic body of the dock felt a little cheap. But upon finding out that it attaches to the smartwatch magnetically, I was willing to let that past. (Mostly) Afterall, who doesn’t like magnets?"
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg23.jpg?alt=media&token=e1922521-38ca-4545-bf7c-d5b6f80eea2d"
        },
        {
            "type": "text",
            "text": "Initially, I had it plugged into my USB charging hub, since no wall adapter can in the box. That took 55 mins to go from 0-100%. What is so VOOC about this Watch Vooc charger? I wondered."
        },
        {
            "type": "text",
            "text": "But after checking with Chester from Music Photo Life, I learnt that it could go faster. Hence, I re-tested it with the SuperVooc charger for the Reno4 Pro and this time, it took under 45mins."
        },
        {
            "type": "text",
            "text": "Moral of the story: If you have an OPPO phone, use its wall adapter to charge the OPPO Watch. If you dont, no need to go out and get one. It may just charge slightly slower."
        },
        {
            "type": "header",
            "text": "Others"
        },
        {
            "type": "subheader",
            "text": "Fitness Tracking"
        },
        {
            "type": "text",
            "text": "As you may have noticed, my review is now more oriented towards experience rather than performance. As such, I shall not go into details about how its tracking compares to other wearables. But from what I have seen so far, there doesn’t seem to be too much of an issue in this area."
        },
        {
            "type": "text",
            "text": "On the topic of fitness tracking, OPPO included two elegant watchfaces that allow you to view your draily progress. Notice how the progress bars were blended into the design, rather than having the design built around the progress bars. These are both masterpieces!"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg24.jpg?alt=media&token=c567ccc4-cdbf-492a-82a5-cf6a250a0fa5"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Foppo-watch-46mm%2Fimg25.jpg?alt=media&token=e5d8c671-82a9-4ec2-858a-b1f596b22e16"
        },
        {
            "type": "subheader",
            "text": "NFC & Payment"
        },
        {
            "type": "text",
            "text": "NFC is off by default and can be enabled in the settings. There is an option to select Google Pay as payment method, but I couldn’t find the Google Pay app in the app store. Hence, we shall assume that it isn’t supported in Singapore, yet. Else, NFC is pretty pointless at the moment."
        },
        {
            "type": "header",
            "text": "Conclusion"
        },
        {
            "type": "text",
            "text": "Current Rating: 8.0 / 10"
        },
        {
            "type": "text",
            "text": "Estimated Future Rating (1Y) : 7.5 – 8.5 / 10"
        },
        {
            "type": "text",
            "text": "In its current state, the OPPO Watch is a wonderful first gen product that doesn’t come with the typical first gen problems. Apart from a couple of small bugs, I don’t see any major flaw in it. (Bad battery life is a common problem faced by smartwatches in general)"
        },
        {
            "type": "text",
            "text": "Regular updates can push my rating from 8.0 to 8.5. Even without that though, my score will still remain an 8.0. OPPO’s custom Wear OS not only introduces new features, it does them really well. Regular Wear OS will take a while to catch up, potentially keeping OPPO Watch relevant for a long time."
        },
        {
            "type": "text",
            "text": "My only concern would be battery deterioration. Currently, the battery life isn’t good. If it deteriorates to anything lower than 85% after a year or two, that would have a noticable impact on the user’s experience. Hence, I lowered its minimum future estimate to a 7.5."
        }
    ]
}