{
    "article": [
        {
            "type": "text",
            "text": "You might not have heard of Yeelight. But if you own a Xiaomi lamp or light at home, you already have a product made by Yeelight. In today’s article, we will be looking at 2 lighting accessories by Yeelight. Both cost under S$30 each and are available at most Mi Stores in Singapore."
        },
        {
            "type": "header",
            "text": "Yeelight Rechargable Sensor Night Light (S$24.90)"
        },
        {
            "type": "text",
            "text": "The first of the two is the rechargable sensor night light. It is a motion-activated light; The sensors inside that turns on the light whenever someone walks pass it at night. You can attach it to any flat surface with the magnetic base provided, or hang it on a pole with the hook at the back."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg1.jpg?alt=media&token=414f6dc9-fb2e-4faa-861a-034726674493"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg2.jpg?alt=media&token=7c89a7cf-6caf-40f8-9b46-35a63e88c049"
        },
        {
            "type": "text",
            "text": "Built quality is superb; It has the familiar matte white design we are used to. The magnet behind is strong, giving a satisfying pull when you return the device to its magentic base."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg3.gif?alt=media&token=b8b22b4a-f31a-40ec-8af4-0894d48aff17"
        },
        {
            "type": "text",
            "text": "On the top is a switch that alternates between on, auto and off. When switched to “on”, the lights are at their greatest brightness. Remove it from the magnetic base and you can use it as a torch light."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg4.jpg?alt=media&token=a384396f-3e27-4506-884d-7d1fc3d6fa61"
        },
        {
            "type": "text",
            "text": "Switch to “auto” mode and the light turns on whenever someone walks near it. It is slightly dimmer than “on”, but bright enough to let you see where you are going in a dark room, without hurting your eyes. Oh, and the sensor is able to detect movements not just from the front, but also the sides."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg5.gif?alt=media&token=c16cc002-b420-49fb-83bf-a1d46a364e0d"
        },
        {
            "type": "text",
            "text": "And when you switch it to “off”, the light turns off. Obviously…"
        },
        {
            "type": "text",
            "text": "Yeelight claims up to 120 days of battery on a single charge. I have been using it for about 3 months now, and I still haven’t had to charge it. But once that battery is low, you can charge it with a micro USB cable."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg6.jpg?alt=media&token=a1c05e2d-8ce5-4a66-8e65-230ec862cca5"
        },
        {
            "type": "text",
            "text": "Overall, I must say that I have no regrets getting the Yeelight Rechargeable Sensor Night Light. With it, I no longer have to turn on my ceiling lights whenever I go to the toilet at night."
        },
        {
            "type": "header",
            "text": "Yeelight Clip-On Lamp J1 (S$29.90)"
        },
        {
            "type": "text",
            "text": "There are multiple version of the J1 clip-on lamp, but mine is the standard donut-shaped one. Once again, the design of this lamp is based on Xiaomi’s matte white style, which I really love."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg7.jpg?alt=media&token=701d28f4-daea-4a2f-8437-eff3d20094a6"
        },
        {
            "type": "text",
            "text": "As the name implies, it has a clip for you to attach to your table or shelve. The spring has quite a bit of tenstion so it clips tightly, but there are these paddings inside to protect your table or shelf. Also on the clip are the capacitive power button and the micro USB charging port."
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg8.jpg?alt=media&token=f0d96e70-a808-47ad-af63-bef855a9c1ac"
        },
        {
            "type": "imageDouble",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg9.jpg?alt=media&token=3bac3fae-075f-4a23-a8c4-c4940a8ddd3e"
        },
        {
            "type": "text",
            "text": "The neck (or arm) is 360° adjustable, so you can adjust it however you want. If you are clipping it on a shelve above your table, you can twist the light around to shine at the table. Being able to bend the neck also means you can compact it before stowing it away. Neat!"
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg10.gif?alt=media&token=41c35258-a3cc-4641-bbd7-18f38b2ef16b"
        },
        {
            "type": "text",
            "text": "Now, to the ring light itself. The power buttons alternates between 3 brightness levels and off. At max brightness, it does an adequate job at allowing you to read and write."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg11.jpg?alt=media&token=21cb98ba-e8cb-46c3-81bc-3ccd2a3177aa"
        },
        {
            "type": "text",
            "text": "Doesn’t this lamp remind you of those ring lights used for photography? Well, you can do just that with the Yeelight Clip-On Lamp J1. Kinda. Just clip it on your tripod and position your phone’s camera in the hole. The other 2 brightness levels are too dim for reading, but they are useful for brightening close-up subjects."
        },
        {
            "type": "imageSingle",
            "text": "https://firebasestorage.googleapis.com/v0/b/logicui-9667a.appspot.com/o/reviews%2Fyeelight-clip-on-lamp-j1%2Fimg12.jpg?alt=media&token=39909c4a-80d8-4031-9d57-c0e1d2c3fa41"
        },
        {
            "type": "header",
            "text": "Future Improvements"
        },
        {
            "type": "text",
            "text": "Like I have said, I am very satisfied with the Rechargable Sensor Night Light. It is so near to perfect, there isn’t much about it that I would like to change. Maybe Yeelight can make the hook thicker and upgrade the charging port to Type-C. Otherwise, there is really no need to update this product for the next few years."
        },
        {
            "type": "text",
            "text": "As for the Clip-On Lamp J1, tapping the button multiple times to get to my desired brightness is troublesome. I hope Yeelight would replace the capacitive button with a knob or a capactive slider. Also, a longer neck would be appreciated as it is a little close to the table now, if you mount it on a table."
        }
    ]
}